#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-EP4g9njmqcMMh3Tv

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
module.logging_bucket.random_id.this: Refreshing state... [id=SssY]
module.hackathon_bucket.random_id.this: Refreshing state... [id=kJkL]
module.config_bucket.random_id.this: Refreshing state... [id=aPbH]
module.postgres_backups_bucket.random_id.this: Refreshing state... [id=Ze9c]
module.remote_state_bucket.random_id.this: Refreshing state... [id=WvCN]
module.secondary.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
aws_iam_user.github_actions: Refreshing state... [id=github.actions]
aws_sns_topic.outages: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:outages]
module.secondary.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
module.database.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_key_pair.main: Refreshing state... [id=macbook-m2-pro]
aws_route53_zone.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0]
module.hackathon_bucket.aws_s3_bucket.this: Refreshing state... [id=hackathon-90990b]
module.logging_bucket.aws_s3_bucket.this: Refreshing state... [id=logging-4acb18]
module.database.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
module.repositories["ticket-tracker"].aws_ecr_repository.this: Refreshing state... [id=ticket-tracker]
module.config_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-68f6c7]
module.remote_state_bucket.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-5af08d]
aws_route53_zone.forkup: Refreshing state... [id=Z06686303IG6BF3DZ1HIL]
module.postgres_backups_bucket.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-65ef5c]
module.repositories["ticket-tracker"].aws_iam_user.builder: Refreshing state... [id=ticket-tracker-builder]
module.personal.aws_iam_user.this: Refreshing state... [id=alex.jackson]
aws_vpc.main: Refreshing state... [id=vpc-0d1ab7c53aec22955]
aws_iam_user.postgres_backups: Refreshing state... [id=postgres.backups]
aws_iam_user.configuration_deployer: Refreshing state... [id=configuration.deployer]
module.database.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/database-policy]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
module.secondary.aws_iam_role.this: Refreshing state... [id=secondary-role]
module.database.aws_iam_role.this: Refreshing state... [id=database-role]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAYEHTA3LZK6JIHCYE]
aws_iam_user_policy.github_actions: Refreshing state... [id=github.actions:github.actions.policy]
module.repositories["ticket-tracker"].aws_iam_access_key.builder: Refreshing state... [id=AKIAYEHTA3LZAHS7ZJVQ]
module.personal.aws_iam_user_login_profile.this: Refreshing state... [id=alex.jackson]
module.personal.aws_iam_access_key.this: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
aws_iam_access_key.postgres_backups: Refreshing state... [id=AKIAYEHTA3LZFDVAEC42]
aws_iam_access_key.configuration_deployer: Refreshing state... [id=AKIAYEHTA3LZKXOXWTYC]
aws_sns_topic_subscription.outages: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:outages:c15a0919-9e06-484e-bef6-08ab63e662d8]
module.repositories["ticket-tracker"].aws_iam_user_policy.builder: Refreshing state... [id=ticket-tracker-builder:ticket-tracker-builder-policy]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
module.secondary.aws_iam_instance_profile.this: Refreshing state... [id=secondary-instance-profile]
module.secondary.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/secondary-policy]
module.personal.aws_iam_user_policy.this: Refreshing state... [id=alex.jackson:alex.jackson.policy]
module.database.aws_iam_instance_profile.this: Refreshing state... [id=database-instance-profile]
module.database.aws_iam_role_policy_attachment.this: Refreshing state... [id=database-role-20231230120447701700000002]
module.secondary.aws_iam_role_policy_attachment.this: Refreshing state... [id=secondary-role-20250515130958670600000001]
aws_internet_gateway.main: Refreshing state... [id=igw-0aa2c09bec52493fc]
aws_subnet.main: Refreshing state... [id=subnet-07936cc0e5c7d83b1]
module.hackathon_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=hackathon-90990b]
module.config_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-68f6c7]
module.logging_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=logging-4acb18]
aws_iam_user_policy.configuration_deployer: Refreshing state... [id=configuration.deployer:configuration.deployer.policy]
module.remote_state_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-5af08d]
aws_route_table.gateway: Refreshing state... [id=rtb-0881a403738fea9c7]
module.postgres_backups_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-65ef5c]
aws_iam_user_policy.postgres_backups: Refreshing state... [id=postgres.backups:postgres.backups.policy]
module.secondary.data.aws_subnet.self: Refreshing...
module.database.aws_ebs_volume.this: Refreshing state... [id=vol-0ac43ea68879b3895]
module.database.aws_security_group.this: Refreshing state... [id=sg-0998f7db6e1ffb7eb]
module.secondary.aws_security_group.this: Refreshing state... [id=sg-09f6eeec0221dfd5a]
module.database.data.aws_subnet.self: Refreshing...
module.secondary.data.aws_subnet.self: Refresh complete after 0s [id=subnet-07936cc0e5c7d83b1]
aws_route_table_association.gateway: Refreshing state... [id=rtbassoc-041dbac3ebba9c5ca]
module.database.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-3173870365]
module.database.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-1983782041]
module.database.aws_security_group_rule.allow_inbound_postgres: Refreshing state... [id=sgrule-3465932672]
module.database.data.aws_subnet.self: Refresh complete after 0s [id=subnet-07936cc0e5c7d83b1]
module.database.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-1306823711]
module.secondary.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-1144224394]
module.secondary.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-594973929]
module.secondary.aws_security_group_rule.allow_outbound_subnet_postgres: Refreshing state... [id=sgrule-3328683172]
module.secondary.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-3522225157]
module.secondary.aws_security_group_rule.allow_outbound_ssh: Refreshing state... [id=sgrule-1031826490]
module.secondary.aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-454363948]
module.secondary.aws_instance.this: Refreshing state... [id=i-0a5cc9ee813117d00]
module.secondary.aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-1542917916]
module.database.aws_instance.this: Refreshing state... [id=i-0e48bcc2a0d16252e]
aws_security_group_rule.allow_inbound_connections_from_secondary: Refreshing state... [id=sgrule-434827353]
module.secondary.aws_eip.this: Refreshing state... [id=eipalloc-0e40b29e840f98ce4]
module.database.aws_volume_attachment.this: Refreshing state... [id=vai-3516952077]
aws_route53_record.records["today"]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_today_A]
aws_route53_record.forkup_records[""]: Refreshing state... [id=Z06686303IG6BF3DZ1HIL__A]
aws_route53_record.records["tags"]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_tags_A]
aws_route53_record.records["forkup"]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_forkup_A]
aws_route53_record.records[""]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0__A]
aws_route53_record.records["uptime"]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_uptime_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_role.forkup_dev will be created
  + resource "aws_iam_role" "forkup_dev" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "forkup-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_sns_topic.expense_analysis_completions will be created
  + resource "aws_sns_topic" "expense_analysis_completions" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "expense-analysis-completions"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.expense_analysis_completions will be created
  + resource "aws_sns_topic_subscription" "expense_analysis_completions" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sqs_queue.expense_analysis_completions will be created
  + resource "aws_sqs_queue" "expense_analysis_completions" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "expense-analysis-completions"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.personal.aws_iam_user_policy.this will be updated in-place
  ~ resource "aws_iam_user_policy" "this" {
        id          = "alex.jackson:alex.jackson.policy"
        name        = "alex.jackson.policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "autoscaling:DescribeAutoScalingGroups",
                          - "ce:GetCostAndUsage",
                          - "ce:GetCostForecast",
                          - "cloudtrail:DescribeTrails",
                          - "cloudwatch:DescribeAlarms",
                          - "cloudwatch:GetMetricData",
                          - "cloudwatch:GetMetricStatistics",
                          - "cloudwatch:GetMetricStream",
                          - "cloudwatch:ListDashboards",
                          - "cloudwatch:ListMetrics",
                          - "ec2:DescribeAddresses",
                          - "ec2:DescribeImages",
                          - "ec2:DescribeInstances",
                          - "ec2:DescribeInstanceStatus",
                          - "ec2:DescribeInstanceTypes",
                          - "ec2:DescribeKeyPairs",
                          - "ec2:DescribeSecurityGroups",
                          - "ec2:DescribeSecurityGroupRules",
                          - "ec2:DescribeRegions",
                          - "iam:ChangePassword",
                          - "iam:GetAccountPasswordPolicy",
                          - "iam:GetRole",
                          - "iam:GetLoginProfile",
                          - "iam:GetPolicy",
                          - "iam:GetUser",
                          - "iam:ListAccessKeys",
                          - "iam:ListAttachedRolePolicies",
                          - "iam:ListGroups",
                          - "iam:ListGroupsForUser",
                          - "iam:ListMFADevices",
                          - "iam:ListPolicies",
                          - "iam:ListRolePolicies",
                          - "iam:ListRoles",
                          - "iam:ListSigningCertificates",
                          - "iam:ListUsers",
                          - "s3:GetAccelerateConfiguration",
                          - "s3:GetBucketNotification",
                          - "s3:GetBucketObjectLockConfiguration",
                          - "s3:GetBucketLogging",
                          - "s3:GetBucketRequestPayment",
                          - "s3:GetBucketTagging",
                          - "s3:GetBucketVersioning",
                          - "s3:GetBucketWebsite",
                          - "s3:GetEncryptionConfiguration",
                          - "s3:GetIntelligentTieringConfiguration",
                          - "s3:ListAllMyBuckets",
                          - "s3:ListBucket",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::logging-4acb18/*"
                    },
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::hackathon-90990b"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::hackathon-90990b/*"
                    },
                  - {
                      - Action   = [
                          - "textract:AnalyzeExpense",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>